In [1]:
import pandas as pd
import numpy as np
import random
import string
np.random.seed(56)

In [2]:
pd.DataFrame({"A":[1,2], "B":[3,4], "C":[5,6]}, index=[1,2])

   A  B  C
1  1  3  5
2  2  4  6

In [3]:
pd.DataFrame([[1,2,3],[4,5,6],[7,8,9],[10,11,12]], index=range(1,5), columns=['A', 'B', 'C'])

    A   B   C
1   1   2   3
2   4   5   6
3   7   8   9
4  10  11  12

In [4]:
pd.Series({"한국":"서울","일본":"도쿄","중국":"베이징"})

한국     서울
일본     도쿄
중국    베이징
dtype: object

In [5]:
pd.DataFrame(np.random.randint(0, 100, size=(2, 3)))

    0   1   2
0  85  15  64
1  34  14  87

In [34]:
def id():
    return ''.join(random.choice(string.ascii_letters) for i in range(5))

In [35]:
def score():
    return [np.random.randint(0, 100) for i in range(1,5)]

In [39]:
pd.DataFrame([score() for i in range(0, 10)], 
             index=[ id() for i in range(0, 10)],
             columns=['국어','영어', '수학', '사회'])

       국어  영어  수학  사회
QvrAb  34  66  74  83
wfyRy  64   4  47  83
FyMIK  85  32   0  41
UwOGx  64  46  43   9
fVdaQ  32  63  29  67
uKEsZ  53  60  70  14
dguzh  66  36  96  56
QtpoD  70  55  94  16
GApaX   1  49  61  21
PCEQB  38  61  14  30